export default [
  {
    term: 'Адмін',
    meaning: ' - (від англ. «аdmin») – адміністратор.',
  },
  {
    term: 'Ака',
    meaning: ' - (точніше a.k.a, від англ. «also known as») – нікнейм, псевдонім.',
  },
  {
    term: 'Блокчейн',
    meaning: ' - (від англ. «blockchain») – це децентралізована база даних, яка зберігає історію всіх активів і транзакцій в одноранговій мережі.',
  },
  {
    term: 'Варез',
    meaning: ' - (від англ. «warez») – будь-яка інтелектуальна власність або програмне забезпечення, яке вільно розповсюджується в мережі Інтернет, при цьому порушуючи права правовласника.',
  },
  {
    term: 'Деплой',
    meaning: ' - (або ще «задеплоїти», від англ. «deploy») – це розгортання (перенесення) програмного забезпечення (виконуваного коду) на сервер або пристрій, де воно буде працювати.',
  },
  {
    term: 'Опенсорс',
    meaning: ' - (від англ. «open source software») - програмне забезпечення  з відкритим вихідним кодом, який може використовувати, доповнювати,  змінювати будь-хто бажаючий. У більшості випадків - це програмне забезпечення є некомерційним проектом.',
  },
  {
    term: 'Світчер',
    meaning: ' - (від англ. «switcher») - людина, яка перейшла працювати в IT програмування з іншої сфери діяльності.',
  },
  {
    term: 'Фреймворк',
    meaning: ' - (від англ. «framework») - програмний продукт, система чи  платформа,  основна мета якої – полегшення, спрощення, створення і підтримка різного роду проектів, програм,  послуг і сайтів.',
  },
  {
    term: 'Айді',
    meaning: ' - (від англ. «Identificator») - ідентифікатор.',
  },
  {
    term: 'Апгрейд',
    meaning: ' - (від англ «upgrade») - оновлення / модернізація апаратного забезпечення (заліза).',
  },
  {
    term: 'Баян',
    meaning: ' - жарт / інформація, яка раніше вже була опублікована / відома.',
  },
  {
    term: 'Браузер',
    meaning: ' - (від англ. «Browser») - програма, за допомогою якої можна переглядати веб-сторінки або, іншими словами, виходити в Інтернет.',
  },
  {
    term: 'Аплікуха',
    meaning:" - (від англ. «Application») - прикладне програмне забезпечення. Наприклад, комп'ютерна програма або мобільний додаток.",
  },
  {
    term: 'Бекенд',
    meaning: ' (від англ. «Back-end») - розробка «внутрішньої частини» сайтів / програм / додатків. Та частина, яку ми не бачимо (то, що твориться під капотом). ',
  },
  {
    term: 'Баг',
    meaning: ' - (від англ. «Bug») - помилка в програмі / коді, через яку результати виконання програми неправильні.',
  },
  {
    term: 'Бан',
    meaning: ' - (від англ. «Ban») - позбавлення або обмеження будь-яких прав користувача (наприклад: залишати коментарі, переглядати певні сторінки і т.д.). Довічний бан - виключення користувача з системи / гри / сайту / групи і т.д.',
  },
  {
    term: 'Брейншторм',
    meaning: ' (від англ. «Brainstorm») - спосіб генерації нових ідей або вирішення існуючих проблем шляхом мозкового штурму.',
  },
  {
    term: 'Бенч',
    meaning: ' - (від англ. «Bench») - лавка або, найчастіше, режим очікування. Вираз «програміст на бенчі» означає, що програміст простоює вхолосту в очікуванні нового проєкту / завдання і, по факту, нічого не робить, але отримує зарплату.',
  },
  {
    term: 'Апрувнути',
    meaning: ' - (або «заапрувити») - підтверджувати, давати добро на виконання чого-небудь.',
  },
  {
    term: 'Вінда',
    meaning: ' - операційна система Windows.',
  },
  {
    term: 'Хард',
    meaning: ' - вінчестер, він же «жорсткий диск», він же «HDD».',
  },
  {
    term: 'Віндусятники',
    meaning: ' - користувач операційної системи Windows (див. Сарказм).',
  },
  {
    term: 'Галера',
    meaning: ' - компанія / підприємство / організація, в якій працює програміст. В основному галера застосовується до компаній, де практикується погане ставлення до працівників.',
  },
  {
    term: 'Випєндрьожник',
    meaning: ' - людина, що працює в IT і має підвищений ЧСВ (відчуття власної важності), який завжди висловлює своє експертну думку, нерідко в невідповідних випадках і не шанує думку оточуючих (дуже часто навіть не удосужується їх вислухати).',
  },
  {
    term: 'Геймдев',
    meaning: ' - (від англ. «Game development») - розробка / створення ігор.',
  },
  {
    term: 'Глюк',
    meaning: ' - незрозумілий збій, затримка, гальмування процесів в програмі / грі.',
  },
  {
    term: 'Гавнокод',
    meaning: ' - поганий код, в якому складно розібратися і який складно підтримувати/модифікувати / змінювати.',
  },
  {
    term: 'Гіг',
    meaning: ' - гігабайт.',
  },
  {
    term: 'Дебажити',
    meaning: ' - (від англ «debug / debugging») - шукати і виправляти помилки в програмі.',
  },
  {
    term: 'Гік',
    meaning: ' - (від англ. «Geek») - людина, яка добре розбирається в певній сфері діяльності, фанат своєї справи. Зараз під гіками дуже часто мають на увазі саме програмістів.',
  },
  {
    term: 'Девелопер',
    meaning: ' - (від англ. «Developer») - розробник.',
  },
  {
    term: 'Девайс',
    meaning: ' - (від англ. «Device») - технічний пристрій (ноутбук / смартфон / планшет / розумні годинник і т.д.).',
  },
  {
    term: 'Гуглити',
    meaning: ' - шукати інформацію в пошуковій системі Google.',
  },
  {
    term: 'Дезігнер',
    meaning: ' - (від англ. «Designer») - дизайнер.',
  },
  {
    term: 'Дедлайн',
    meaning: ' - (від англ. «Deadline») - крайній термін виконання або здачі проєкту / завдання / роботи.',
  },
  {
    term: 'Дефолтний',
    meaning: ' (або «по дефолту», від англ. «Default») - той, який є типовим, стандартний.',
  },
  {
    term: 'Домен',
    meaning: " - (від англ. «Domain») - унікальна адреса / ім'я сайту в Інтернеті. Наприклад, ravesli.com - це домен, який складається з доменного імені ravesli і домена першого рівня .com.",
  },
  {
    term: 'Джуніор',
    meaning: ' - (або «джун», від англ. «Junior Developer») - початковий рівень програміста. Людина, яка має мінімальний досвід і навички.',
  },{
    term: 'Дрова',
    meaning: ' - драйвера.',
  },
  {
    term: 'Валідний',
    meaning: ' - (від англ. «Valid») - коректний / дійсний. Той, який відповідає вимогам / умовам / правилам.',
  },

  {
    term: 'Вебінар',
    meaning: ' - (від англ. «Web based seminar») - це семінар, презентація або лекція на певну тему, яка проходить онлайн, в режимі реального часу, в Інтернеті. Під цим терміном також мають на увазі і запис вебінару, який проходив раніше.',
  },
  {
    term: 'Задрот',
    meaning: ' - людина, яка занадто багато часу приділяє віртуальної реальності (будь то ігри, програмування або ще що-небудь). Також іноді під цим терміном мають на увазі фанатів своєї справи (не залежно від спеціальності), які не завжди добре пристосовані до умов реального життя.',
  },

  {
    term: 'Запиляти',
    meaning: ' - (або «залити») - завантажити, виставити на загальний огляд. Наприклад, запиляти відосік на YouTube = завантажити відео в YouTube.',
  },
  {
    term: 'Зафакапити',
    meaning: ' - (або «нафакапити») - не впоратися з виконанням поставленого завдання, зіпсувати завдання.',
  },
  {
    term: 'Зашквар',
    meaning: ' - ганьба, мерзенна поведінка.',
  },
  {
    term: 'Імхо',
    meaning: ' - (від англ. «IMHO» = «In My Humble Opinion») - на мою скромну думку.',
  },
  {
    term: 'Інсталювати',
    meaning: ' - (від англ. «Install») - встановлювати. Наприклад, інсталювати Вінду = встановити Windows.',
  },
  {
    term: 'Кастомер',
    meaning: ' - (від англ. «Customer») - покупець, клієнт або замовник.',
  },
  {
    term: 'Юзкейс',
    meaning: ' - (від англ. «usecase») - реальна ситуація / випадок.',
  },
  {
    term: 'Кілобакси',
    meaning: ' - тисячі доларів. Приставка кіло = k (з англ. означає «тисяча»).',
  },
  {
    term: 'Цегла',
    meaning: ' - непрацюючий пристрій (наприклад, телефон).',
  },
  {
    term: 'Коворкінг',
    meaning: ' - (від англ. «Coworking») - місце для організації праці фахівцями однієї або відразу декількох сфер діяльності, фрілансерів. Іншими словами, сучасний орендований офіс для роботи фахівців.',
  },
  {
    term: 'Кодити',
    meaning: ' - програмувати.',
  },
  {
    term: 'Комітнути',
    meaning: ' - (або «закомітити», «зробити коміт», від англ. «Commit») - зберегти / зафіксувати зміни коду в репозиторії (сховище) коду.',
  },
  {
    term: 'Компіляція',
    meaning: ' - конвертація коду, написаного на високорівневій мові, в програму, яку процесор розуміє безпосередньо. -',
  },
  {
    term: 'Компілятор',
    meaning: ' - програма, яка виконує компіляцію.',
  },
  {
    term: 'Костиль',
    meaning: ' - виправлення серйозних багів / дірок / помилок без належного виправлення цілої системи. Тобто рішення на коліні в найкоротші терміни на шкоду ефективності і хорошим практикам програмування.',
  },
  {
    term: 'Кракозябри',
    meaning: ' - набір незрозумілих символів, нісенітниця. Виникає в результаті неправильної кодування. Іноді кракозябри можна спостерігати на сайтах з невірним кодом: РџСЂРёРІРμС,! РњРμРЅСЏ.',
  },
  {
    term: 'Кріпово ',
    meaning: ' - страшно.',
  },
  {
    term: 'Кросплатформний',
    meaning: ' - - той, який не залежить від апаратних платформ і операційних систем (наприклад, може працювати як на Windows, так і на Linux).',
  },
  {
    term: 'Кряк',
    meaning: ' - ( від англ. «Crack») - спеціальна програма або доповнення до програми для злому іншого програмного забезпечення. В основному використовується для перетворення ліцензійної (платній) версії чого-небудь (програми / гри) в безкоштовну.',
  },
  {
    term: 'Лагати',
    meaning: ' - (або «лаги») - затримка у виконанні програми / гри, відсутність реагування на дії користувача. Синонім до слова глюк.',
  },
  {
    term: 'Ламер',
    meaning: ' - (від англ. «Lamer») - недосвідчений користувач, людина, яка не розбирається в чомусь, але думає, що розбирається. Не плутати з «чайником».',
  },
  {
    term: 'Лікбез',
    meaning: ' - - ліквідація безграмотності. Вивчати основи.',
  },
  {
    term: 'Лінк',
    meaning: ' - (від англ. «Link») - посилання на який-небудь ресурс.',
  },
  {
    term: 'Ліцуха',
    meaning: ' - ліцензія.',
  },
  {
    term: 'Лог',
    meaning: ' - (від англ. «Log») - журнал, в якому записуються в хронологічному порядку всі виконані дії в чому-небудь (в програмі, на сервері). Наприклад: час виникнення помилок, збоїв, дії користувачів і т.д.',
  },
  {
    term: 'Материнка',
    meaning: ' - материнська плата.',
  },
  {
    term: 'Мануал',
    meaning: ' - (від англ. «Manual») - керівництво, інструкція по використанню чого-небудь.',
  },
  {
    term: 'Мітап',
    meaning: ' - (від англ. «Meetup») - збори / зустріч фахівців певної сфери діяльності для обміну досвідом, в освітніх цілях або просто для спілкування в неформальній обстановці.',
  },
  {
    term: 'Мило',
    meaning: ' - адреса електронної пошти, E-mail користувача.',
  },
  {
    term: 'Нативний',
    meaning: ' - (від англ. «Native») - рідний. Часто використовують словосполучення нативний код = вихідний код (НЕ модифікований пізніше), написаний розробниками.',
  },
  {
    term: 'Нетворкінг',
    meaning: ' - (від англ. «Networking») - оточення фахівців певної сфери діяльності, де, використовуючи зв"язки між цими людьми, можна вирішити специфічні проблеми / завдання або просто познайомитися для спільної співпраці.',
  },
  {
    term: 'Ноулайфер',
    meaning: " - людина, яка більшість свого часу проводить за комп'ютером / ноутбуком / смартфоном у віртуальному світі (Інтернет / соц.сети / гри). Людина, яка не має особистого життя, хобі або будь-яких інших занять в реальному світі.",
  },
  {
    term: 'Нуб',
    meaning: ' - ( від англ «newbie») - новачок або людина у якої нічого не виходить, або він не знає, як правильно щось зробити. Недосвідчений.',
  },
  {
    term: 'Софт скіли',
    meaning: ' - (від англ. «Soft skills») – соціальні / комунікаційні / особистісні навички / якості, необхідні, в першу чергу, для адаптації і роботи в колективі.',
  },
  {
    term: 'Хард скіли',
    meaning: ' - (від англ. «Hard skills») – технічні знання і навички.',
  },
  {
    term: 'Фіча',
    meaning: ' - (від англ. «Feature») – особливість, унікальна можливість, властивість. Популярний вислів: «Це не баг, а фіча». Часто під фічею програмісти маскують баги, з якими не знають, що робити.',
  },
  {
    term: 'Продакшн',
    meaning: ' – кінцева версія програми або сайту, доступна пересічним користувачам (production). Простіше кажучи, те, що ми можемо знайти в Google, скачати з Google Play або Apple Store.',
  },
  {
    term: 'Реліз',
    meaning: ' – своєрідний «вихід у світ», release. Випуск цілого додатка або його частини в продакшн-версії для кінцевого користувача або в проміжній для внутрішнього тестування. В ідеалі кожен спринт повинен закінчуватися релізом.',
  },
  {
    term: 'Фідбек',
    meaning: ' (від англ. «Feedback») – зворотний зв’язок. Наприклад, зворотній зв’язок від користувачів. Під зворотним зв’язком маються на увазі будь-які згадки, відгуки, коментарі, повідомлення про бренд / компанії / сайті.',
  },
  {
    term: 'Ліба',
    meaning: ' - (англ. «library») – бібліотека коду, як React, D3, Butterknife.',
  },
  {
    term: 'Мержити',
    meaning: ' - (англ. «merge») – об’єднувати чи виконувати злиття гілок веток коду.',
  },
  {
    term: 'Парсити',
    meaning: ' - (англ. «parse») — збирати та аналізувати дані.',
  },
  {
    term: 'Пушити',
    meaning: ' — застосовувати команду push; заливати код на сервер, публікувати щось.',
  },
  {
    term: 'Жаба',
    meaning: ' — мова програмування Java.',
  },
  {
    term: 'Жабаскрипт',
    meaning: ' — мова програмування JavaScript.',
  },
  {
    term: 'Залити',
    meaning: ' — завантажити. Наприклад, «завантажити файли на сервер».',
  },
  {
    term: 'Змія',
    meaning: ' — мова програмування Python.',
  },
  {
    term: 'Ітерація',
    meaning: ' — повторення. «Ми зробили декілька ітерацій» — ми повторили дію декілька разів.',
  },
  {
    term: 'Лінтер',
    meaning: ' — загальна назва програм, які аналізують код та попереджують розробника про помилки. ',
  },
  {
    term: 'Навбар',
    meaning: ' — навігаційний блок на сайті чи в інтерфейсі програми.',
  },
  {
    term: 'Подаван',
    meaning: ' — ірогічна назва стажора чи джуніора.  ',
  },
  {
    term: 'Ось',
    meaning: '  — операційна система. ',
  },
  {
    term: 'Підвал',
    meaning: ' — те ж саме, що і «футер». Елемент структури сторінки, який знаходиться в нижній частині і містить службову інформацію.',
  },
  {
    term: 'Рекурсія',
    meaning: ' — описання процесу за допомогою самого процесу. Наприклад, вираз «рекурсивний виклик функції» описує ситуацію, в якій функція викликає сама себе.',
  },
  {
    term: 'Рєпа',
    meaning: ' — репозиторій, який зберігає дані. Наприклад, код програми можна зберігати в репозиторії на GitHub. ',
  },
  {
    term: 'Рідмі',
    meaning: '— файл Readme, який містить інформацію про програму. ', 
  },
  
]