export default [
  {
    question: "Дропнути базу — це…",
    answers: ['Вдало закупитися картоплею на овочевій базі', 'Видалити базу даних', 'Встановити та налаштувати базу даних'],
    correctAnswer: 1,
  },
  {
    question: "Хардкодити як слоупок — це…",
    answers: [`Вказувати в коді дані, які повинні вичислятися динамічно, а так роблять тільки не надто продвинуті люди`, `Довго та усердно писати код, як супермен`, `Не звертати увагу на проблеми з сервером, як зробив би справжній сисадмін`],
    correctAnswer: 0,
  },
  {
    question: "Коли свариться лінтер — це значить, що…",
    answers: [`Не встановлений зв’язок між сокетом і портом відправки даних`, `Керівник проекту не задоволений Вами`, `Сервіс перевірки знайшов якісь помилки`, `Джуніор не задоволений результатами своєї роботи`],
    correctAnswer: 2,
  },
  {
    question: "Коли один сказав другому, що ключ від тулзи він поклав йому на мило - це значить...",
    answers: [`Поклав ключ від дачі на мило вуличного умивальника`, `Виправив помилки в коді і результат відправив на внутрішню систему повідомлень`, `Відправив активаційний код програми на пошту`],
    correctAnswer: 2,
  },
  {
    question: "Один тімлід сказав другому, що посадив енікейщика в пісочницю. Що він мав на увазі?",
    answers: [`Відправив дитину пограти в пісочниці на дитячій площадці`, `Зробив для не дуже кваліфікованого працівника безпечну робочу середу`, `Відправив системного адміністратора шукати поломку на серверному обладнанні`],
    correctAnswer: 1,
  },
  {
    question: "Якa з цих їстівних фраз не має відношення до веб-розробки?",
    answers: [`Гамбургер`, `Хлібні крихти`,`Печенька`, `Чай`, `Вершки`],
    correctAnswer: 4,
  },
]
  
