export default [
  {
    term: 'Адмін',
    meaning: ' - (від англ. «аdmin») – адміністратор.',
  },
  {
    term: 'Ака',
    meaning: ' - (точніше a.k.a, від англ. «also known as») – нікнейм, псевдонім.',
  },
  {
    term: 'Блокчейн',
    meaning: ' - (від англ. «blockchain») – це децентралізована база даних, яка зберігає історію всіх активів і транзакцій в одноранговій мережі.',
  },
  {
    term: 'Варез',
    meaning: ' - (від англ. «warez») – будь-яка інтелектуальна власність або програмне забезпечення, яке вільно розповсюджується в мережі Інтернет, при цьому порушуючи права правовласника.',
  },
  {
    term: 'Деплой',
    meaning: ' - (або ще «задеплоїти», від англ. «deploy») – це розгортання (перенесення) програмного забезпечення (виконуваного коду) на сервер або пристрій, де воно буде працювати.',
  },
  {
    term: 'Опенсорс',
    meaning: ' - (від англ. «open source software») - програмне забезпечення  з відкритим вихідним кодом, який може використовувати, доповнювати,  змінювати будь-хто бажаючий. У більшості випадків - це програмне забезпечення є некомерційним проектом.',
  },
  {
    term: 'Світчер',
    meaning: ' - (від англ. «switcher») - людина, яка перейшла працювати в IT програмування з іншої сфери діяльності.',
  },
  {
    term: 'Фреймворк',
    meaning: ' - (від англ. «framework») - програмний продукт, система чи  платформа,  основна мета якої – полегшення, спрощення, створення і підтримка різного роду проектів, програм,  послуг і сайтів.',
  },
  // {
  //   term: '',
  //   meaning: '',
  // },
  // {
  //   term: '',
  //   meaning: '',
  // },
  // {
  //   term: '',
  //   meaning: '',
  // },
  // {
  //   term: '',
  //   meaning: '',
  // },
  // {
  //   term: '',
  //   meaning: '',
  // },
  // {
  //   term: '',
  //   meaning: '',
  // },
  // {
  //   term: '',
  //   meaning: '',
  // },
  // {
  //   term: '',
  //   meaning: '',
  // },
  // {
  //   term: '',
  //   meaning: '',
  // },
  // {
  //   term: '',
  //   meaning: '',
  // },
  // {
  //   term: '',
  //   meaning: '',
  // },
  
]